uhnp/src/Documents/тн_ПриказНаКомиссиюПоИнвентаризации/тн_ПриказНаКомиссиюПоИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>тн_ПриказНаКомиссиюПоИнвентаризации</name>
  <comment>Выполнение задач №000038912</comment>
  <registerRecords>InformationRegister.тн_Комиссии</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидКомиссии</name>
    <type>
      <types>EnumRef.тн_ВидКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксперт</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКомиссии</name>
    <comment>// Белоконенко Денис 28.01.2026 Выполнение задач №000056425</comment>
    <type>
      <types>CatalogRef.тн_ВидыКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>// Белоконенко Денис 28.01.2026 Выполнение задач №000056425</comment>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>// Белоконенко Денис 28.01.2026 Выполнение задач №000056425</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧленыКомиссии</name>
    <attributes>
      <name>ФИО</name>
      <comment>Фамилия Имя Отчество</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньЧленства</name>
      <type>
        <types>EnumRef.тн_СтепеньЧленстваВКомиссии</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/тн_ПриказНаКомиссиюПоИнвентаризации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

// Губернаторова Дарья 06.09.2021 Выполнение задач №000038912
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);

	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаКомиссии(Запрос, ТекстыЗапроса, Регистры);
	
	//НАЧАЛО Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
	//ПоведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	// НАЧАЛО Гутарова Екатерина 23.11.2023 Выполнение задач №000047585
	//ИнтеграцияЕГАИС.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);	
	ПроведениеСерверУХ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	// КОНЕЦ Гутарова Екатерина 23.11.2023 Выполнение задач №000047585		
	//КОНЕЦ Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896       
	
КонецПроцедуры

// Губернаторова Дарья 06.09.2021 Выполнение задач №000038912
Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", 					ДокументСсылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Дата КАК Период,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Номер КАК Номер,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Организация КАК Организация,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Эксперт КАК Эксперт,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Ссылка КАК Ссылка,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.ВидКомиссии КАК ВидКомиссии,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Комментарий КАК Комментарий,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.ПометкаУдаления КАК ПометкаУдаления,
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Проведен КАК Проведен
	|ИЗ
	|	Документ.тн_ПриказНаКомиссиюПоИнвентаризации КАК тн_ПриказНаКомиссиюПоИнвентаризации
	|ГДЕ
	|	тн_ПриказНаКомиссиюПоИнвентаризации.Ссылка = &Ссылка";

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",						Реквизиты.Период);
	Запрос.УстановитьПараметр("Номер",						Реквизиты.Номер);
	Запрос.УстановитьПараметр("Организация",				Реквизиты.Организация);
	Запрос.УстановитьПараметр("Эксперт",					Реквизиты.Эксперт);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации",	Реквизиты.ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ВидКомиссии",				Реквизиты.ВидКомиссии);
	Запрос.УстановитьПараметр("Комментарий",				Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",			Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",					Реквизиты.Проведен);
			
КонецПроцедуры

// Губернаторова Дарья 06.09.2021 Выполнение задач №000038912
Функция ТекстЗапросаТаблицаКомиссии(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "тн_Комиссии";
	//НАЧАЛО Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896
	//Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
	//КОНЕЦ Шабалкина Е.В. 22.12.2021 Выполнение задач №000039896	
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.Ссылка.ВидКомиссии КАК ВидКомиссии,
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.ФИО КАК ФИО,
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.Ссылка.Организация КАК Организация,
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.Должность КАК Должность,
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.Ссылка.Эксперт КАК Эксперт,
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.СтепеньЧленства КАК СтепеньЧленства
	|ИЗ
	|	Документ.тн_ПриказНаКомиссиюПоИнвентаризации.ЧленыКомиссии КАК тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии
	|ГДЕ
	|	тн_ПриказНаКомиссиюПоИнвентаризацииЧленыКомиссии.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
